{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import sys\n",
    "sys.path.append(os.path.pardir)\n",
    "from utils import utils\n",
    "import time\n",
    "import neo4j\n",
    "from neo4j import GraphDatabase\n",
    "import babelnet as bn\n",
    "from babelnet import BabelSynsetID, Language\n",
    "from babelnet.data.relation import BabelPointer\n",
    "from zerorpc import TimeoutExpired, LostRemote"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "URI = \"bolt://localhost:7687\"\n",
    "AUTH = (\"giovanni\", \"BabeldistGraph\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "def run_no_exception(session: neo4j.Session, query: str):\n",
    "    try:\n",
    "        session.run(query)\n",
    "    except Exception as e:\n",
    "        pass"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [],
   "source": [
    "merge_graph_query = \"\"\"\n",
    "MERGE (s:Synset {synsetID: $synsetID_1})\n",
    "MERGE (hyponym:Synset {synsetID: $synsetID_2})\n",
    "MERGE (s)<-[:IS_A]-(hyponym) \"\"\"\n",
    "\n",
    "count_nodes_query = \"\"\"\n",
    "MATCH (s:Synset)\n",
    "RETURN count(s) \"\"\"\n",
    "\n",
    "count_edges_query = \"\"\"\n",
    "MATCH ()-[r:IS_A]->()\n",
    "RETURN count(r) \"\"\"\n",
    "\n",
    "shortestPath_query = \"\"\"\n",
    "MATCH (s1:Synset {synsetID: $synsetID_1})\n",
    "MATCH (s2:Synset {synsetID: $synsetID_2})\n",
    "MATCH p = shortestPath((s1)-[:IS_A*..10]-(s2))\n",
    "RETURN p \"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Added 10994 nodes, added 11046 edges.\n"
     ]
    }
   ],
   "source": [
    "# EXPORTING BABELNET TO NEO4J - ONLY SYNSET IDs, NO LEMMA OR OTHER PROPERTIES\n",
    "\n",
    "fname = utils.get_current_logfile_number('exporting_neo4j', extension='.log')\n",
    "\n",
    "visited = set()\n",
    "max_visits, n = 100, 0\n",
    "start_synset_id = 'bn:00062164n' # physical entity\n",
    "q = [BabelSynsetID(start_synset_id)]\n",
    "\n",
    "# creating driver isn't lightweight, but for this case is ok...\n",
    "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "    with driver.session() as session:\n",
    "        run_no_exception(session, 'CREATE CONSTRAINT FOR (s:Synset) REQUIRE s.synsetID IS UNIQUE')\n",
    "        tx = session.begin_transaction()\n",
    "        \n",
    "        start_n, start_r = tx.run(count_nodes_query).values()[0][0], tx.run(count_edges_query).values()[0][0]\n",
    "        \n",
    "        with open(fname, 'w') as logfname:\n",
    "            start_t = time.time()\n",
    "            while q and n < max_visits:\n",
    "                n += 1\n",
    "                pb = utils.get_progress_bar(int((n / max_visits) * 100))\n",
    "                print(pb, end='\\r')\n",
    "\n",
    "                try:\n",
    "                    synset = q.pop(0).to_synset()\n",
    "                    hyponym_edges = synset.outgoing_edges(BabelPointer.ANY_HYPONYM)        \n",
    "                except (TimeoutExpired, LostRemote) as e:\n",
    "                    e.with_traceback()\n",
    "                    hyponym_edges = []\n",
    "\n",
    "                for edge in hyponym_edges:\n",
    "                    try:\n",
    "                        result = tx.run(merge_graph_query, {\n",
    "                            'synsetID_1': str(synset.id), \n",
    "                            'synsetID_2': str(edge.id_target) })\n",
    "                    except Exception as e:\n",
    "                        e.with_traceback()\n",
    "\n",
    "                    if edge.id_target not in visited and edge.id_target not in q:                        \n",
    "                        q.append(edge.id_target)\n",
    "                        visited.add(edge.id_target)\n",
    "                if n % 1000 == 0:\n",
    "                    tx.commit()\n",
    "                    tx = session.begin_transaction()\n",
    "\n",
    "            end_n, end_r = tx.run(count_nodes_query).values()[0][0], tx.run(count_edges_query).values()[0][0]\n",
    "            tx.commit()\n",
    "            print(f'Added {end_n - start_n} nodes, added {end_r - start_r} edges.')\n",
    "            \n",
    "            logfname.write(f'start_node={start_synset_id}\\n')\n",
    "            logfname.write(f'max_visits={max_visits}\\n')\n",
    "            if q == []: logfname.write('Queue empy\\n')\n",
    "            if n == max_visits: logfname.write('Reached max visits\\n')\n",
    "            logfname.write(f'Added {end_n - start_n} nodes, added {end_r - start_r} edges.')\n",
    "            end_t = time.time()\n",
    "            min, sec = divmod(end_t - start_t, 60)\n",
    "            logfname.write(f'total_time,{int(min)}m,{int(sec)}s') "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{bn:15088619n,\n",
       " bn:01354293n,\n",
       " bn:13860447n,\n",
       " bn:15365424n,\n",
       " bn:16065594n,\n",
       " bn:15361808n,\n",
       " bn:02063665n,\n",
       " bn:16181452n,\n",
       " bn:08860223n,\n",
       " bn:15146556n,\n",
       " bn:16084811n,\n",
       " bn:02448737n,\n",
       " bn:23882717n,\n",
       " bn:00067319n,\n",
       " bn:16123255n,\n",
       " bn:08960646n,\n",
       " bn:25610039n,\n",
       " bn:16221175n,\n",
       " bn:09266541n,\n",
       " bn:16399429n,\n",
       " bn:14770561n,\n",
       " bn:00022875n,\n",
       " bn:15479027n,\n",
       " bn:16174695n,\n",
       " bn:16391749n,\n",
       " bn:11805040n,\n",
       " bn:00005109n,\n",
       " bn:14946113n,\n",
       " bn:02735455n,\n",
       " bn:00034104n,\n",
       " bn:13512269n,\n",
       " bn:18643830n,\n",
       " bn:00030144n,\n",
       " bn:00046620n,\n",
       " bn:16924506n,\n",
       " bn:16117649n,\n",
       " bn:04709834n,\n",
       " bn:01353081n,\n",
       " bn:16584098n,\n",
       " bn:17760443n,\n",
       " bn:15366166n,\n",
       " bn:14957061n,\n",
       " bn:15365754n,\n",
       " bn:16178104n,\n",
       " bn:16350542n,\n",
       " bn:00021396n,\n",
       " bn:09345749n,\n",
       " bn:14334673n,\n",
       " bn:16597964n,\n",
       " bn:02491227n,\n",
       " bn:01359208n,\n",
       " bn:18098794n,\n",
       " bn:00032322n,\n",
       " bn:23110305n,\n",
       " bn:00072147n,\n",
       " bn:16091891n,\n",
       " bn:01294332n,\n",
       " bn:00003342n,\n",
       " bn:16063007n,\n",
       " bn:16072448n,\n",
       " bn:16187547n,\n",
       " bn:01885981n,\n",
       " bn:00060819n,\n",
       " bn:16402931n,\n",
       " bn:16223141n,\n",
       " bn:01354242n,\n",
       " bn:17669308n,\n",
       " bn:05450135n,\n",
       " bn:18160016n,\n",
       " bn:00004663n,\n",
       " bn:05066170n,\n",
       " bn:16185911n,\n",
       " bn:15496452n,\n",
       " bn:03552485n,\n",
       " bn:04702577n,\n",
       " bn:16181634n,\n",
       " bn:14957277n,\n",
       " bn:16186108n,\n",
       " bn:18481484n,\n",
       " bn:16753093n,\n",
       " bn:23573370n,\n",
       " bn:00080840n,\n",
       " bn:16178484n,\n",
       " bn:04060659n,\n",
       " bn:21661862n,\n",
       " bn:01182568n,\n",
       " bn:05790440n,\n",
       " bn:22420920n,\n",
       " bn:01843153n,\n",
       " bn:05066017n,\n",
       " bn:05351189n,\n",
       " bn:05767572n,\n",
       " bn:00011468n,\n",
       " bn:16747163n,\n",
       " bn:20033452n,\n",
       " bn:00035536n,\n",
       " bn:04975886n,\n",
       " bn:16187670n,\n",
       " bn:01464212n,\n",
       " bn:03568814n,\n",
       " bn:16415473n,\n",
       " bn:02923847n,\n",
       " bn:00028157n,\n",
       " bn:08662489n,\n",
       " bn:16014975n,\n",
       " bn:02045340n,\n",
       " bn:11272268n,\n",
       " bn:06891591n,\n",
       " bn:15086381n,\n",
       " bn:00011595n,\n",
       " bn:05334550n,\n",
       " bn:16183693n,\n",
       " bn:16395196n,\n",
       " bn:15351446n,\n",
       " bn:06947255n,\n",
       " bn:17422742n,\n",
       " bn:00180998n,\n",
       " bn:06947288n,\n",
       " bn:15201318n,\n",
       " bn:15351473n,\n",
       " bn:00058072n,\n",
       " bn:18297672n,\n",
       " bn:16181043n,\n",
       " bn:01860842n,\n",
       " bn:15364266n,\n",
       " bn:14214761n,\n",
       " bn:18098768n,\n",
       " bn:23614226n,\n",
       " bn:01885859n,\n",
       " bn:14971683n,\n",
       " bn:15353086n,\n",
       " bn:16073986n,\n",
       " bn:00335472n,\n",
       " bn:15495535n,\n",
       " bn:02502919n,\n",
       " bn:15357256n,\n",
       " bn:22621880n,\n",
       " bn:03420429n,\n",
       " bn:16186112n,\n",
       " bn:13859127n,\n",
       " bn:16123450n,\n",
       " bn:16401524n,\n",
       " bn:15364442n,\n",
       " bn:10464361n,\n",
       " bn:16183699n,\n",
       " bn:16401417n,\n",
       " bn:17630190n,\n",
       " bn:03891781n,\n",
       " bn:16296126n,\n",
       " bn:06946721n,\n",
       " bn:09266519n,\n",
       " bn:14962670n,\n",
       " bn:14976285n,\n",
       " bn:16187919n,\n",
       " bn:01862322n,\n",
       " bn:14976139n,\n",
       " bn:15199761n,\n",
       " bn:01702864n,\n",
       " bn:01498375n,\n",
       " bn:14959239n,\n",
       " bn:05190630n,\n",
       " bn:13860491n,\n",
       " bn:06941524n,\n",
       " bn:16223024n,\n",
       " bn:00024209n,\n",
       " bn:01843123n,\n",
       " bn:02770575n,\n",
       " bn:16216850n,\n",
       " bn:06946985n,\n",
       " bn:06753760n,\n",
       " bn:11278850n,\n",
       " bn:15191820n,\n",
       " bn:23965566n,\n",
       " bn:14957284n,\n",
       " bn:00066901n,\n",
       " bn:09261593n,\n",
       " bn:14967357n,\n",
       " bn:16391442n,\n",
       " bn:05590575n,\n",
       " bn:16405284n,\n",
       " bn:15081543n,\n",
       " bn:23965567n,\n",
       " bn:16754458n,\n",
       " bn:16280873n,\n",
       " bn:16062420n,\n",
       " bn:16415608n,\n",
       " bn:00034267n,\n",
       " bn:02628245n,\n",
       " bn:00046073n,\n",
       " bn:15819887n,\n",
       " bn:06947264n,\n",
       " bn:12797629n,\n",
       " bn:08063052n,\n",
       " bn:02102625n,\n",
       " bn:16845841n,\n",
       " bn:00035484n,\n",
       " bn:16320145n,\n",
       " bn:16183162n,\n",
       " bn:14766674n,\n",
       " bn:09793009n,\n",
       " bn:25347689n,\n",
       " bn:00022429n,\n",
       " bn:08337292n,\n",
       " bn:02403264n,\n",
       " bn:06792167n,\n",
       " bn:03672026n,\n",
       " bn:02569110n,\n",
       " bn:16341188n,\n",
       " bn:05078388n,\n",
       " bn:00081359n,\n",
       " bn:16975665n,\n",
       " bn:06579508n,\n",
       " bn:16183010n,\n",
       " bn:00064732n,\n",
       " bn:16401600n,\n",
       " bn:25705138n,\n",
       " bn:06355813n,\n",
       " bn:15495828n,\n",
       " bn:01902747n,\n",
       " bn:02317127n,\n",
       " bn:08748928n,\n",
       " bn:16391605n,\n",
       " bn:14967484n,\n",
       " bn:17438969n,\n",
       " bn:01026105n,\n",
       " bn:03271229n,\n",
       " bn:00021952n,\n",
       " bn:14978887n,\n",
       " bn:03588646n,\n",
       " bn:16065602n,\n",
       " bn:01862318n,\n",
       " bn:00007881n,\n",
       " bn:08559144n,\n",
       " bn:01925617n,\n",
       " bn:16067442n,\n",
       " bn:15479187n,\n",
       " bn:16295911n,\n",
       " bn:17627863n,\n",
       " bn:00072759n,\n",
       " bn:15191830n,\n",
       " bn:00064545n,\n",
       " bn:07528763n,\n",
       " bn:16063274n,\n",
       " bn:16280862n,\n",
       " bn:03054930n,\n",
       " bn:09266531n,\n",
       " bn:12779018n,\n",
       " bn:17748566n,\n",
       " bn:05069514n,\n",
       " bn:02935064n,\n",
       " bn:15364244n,\n",
       " bn:06803309n,\n",
       " bn:17680107n,\n",
       " bn:03851172n,\n",
       " bn:06543914n,\n",
       " bn:16405219n,\n",
       " bn:17025499n,\n",
       " bn:07162334n,\n",
       " bn:16200459n,\n",
       " bn:00988908n,\n",
       " bn:22331626n,\n",
       " bn:27269757n,\n",
       " bn:06955014n,\n",
       " bn:16606065n,\n",
       " bn:19483275n,\n",
       " bn:06942098n,\n",
       " bn:14973308n,\n",
       " bn:14971665n,\n",
       " bn:15011515n,\n",
       " bn:03107748n,\n",
       " bn:15009592n,\n",
       " bn:00326126n,\n",
       " bn:16186242n,\n",
       " bn:16400879n,\n",
       " bn:05064981n,\n",
       " bn:13864276n,\n",
       " bn:09076411n,\n",
       " bn:11278853n,\n",
       " bn:16120571n,\n",
       " bn:16401530n,\n",
       " bn:06856879n,\n",
       " bn:27268355n,\n",
       " bn:16087561n,\n",
       " bn:15365892n,\n",
       " bn:15495890n,\n",
       " bn:16063733n,\n",
       " bn:16200513n,\n",
       " bn:16754469n,\n",
       " bn:04080575n,\n",
       " bn:01416702n,\n",
       " bn:02022459n,\n",
       " bn:06976634n,\n",
       " bn:17463457n,\n",
       " bn:06470623n,\n",
       " bn:00050691n,\n",
       " bn:16399399n,\n",
       " bn:00078832n,\n",
       " bn:16601020n,\n",
       " bn:08794199n,\n",
       " bn:10742878n,\n",
       " bn:16187639n,\n",
       " bn:16085389n,\n",
       " bn:16073562n,\n",
       " bn:22190994n,\n",
       " bn:16399934n,\n",
       " bn:17745003n,\n",
       " bn:15353204n,\n",
       " bn:16515086n,\n",
       " bn:03690857n,\n",
       " bn:21255299n,\n",
       " bn:15086242n,\n",
       " bn:13860177n,\n",
       " bn:16220632n,\n",
       " bn:00225861n,\n",
       " bn:15090559n,\n",
       " bn:00153754n,\n",
       " bn:02925208n,\n",
       " bn:15658717n,\n",
       " bn:17176201n,\n",
       " bn:16406548n,\n",
       " bn:15344344n,\n",
       " bn:16405574n,\n",
       " bn:01571762n,\n",
       " bn:02549237n,\n",
       " bn:01829725n,\n",
       " bn:05588121n,\n",
       " bn:00077721n,\n",
       " bn:16220238n,\n",
       " bn:14945836n,\n",
       " bn:14973517n,\n",
       " bn:16074101n,\n",
       " bn:20033024n,\n",
       " bn:16601367n,\n",
       " bn:00041940n,\n",
       " bn:14727095n,\n",
       " bn:15352072n,\n",
       " bn:00073765n,\n",
       " bn:14962718n,\n",
       " bn:09261465n,\n",
       " bn:00060047n,\n",
       " bn:00067429n,\n",
       " bn:01826585n,\n",
       " bn:15873013n,\n",
       " bn:16283934n,\n",
       " bn:01872015n,\n",
       " bn:00054865n,\n",
       " bn:17579720n,\n",
       " bn:04921161n,\n",
       " bn:03824652n,\n",
       " bn:01353306n,\n",
       " bn:14676876n,\n",
       " bn:14970478n,\n",
       " bn:02187990n,\n",
       " bn:16415611n,\n",
       " bn:15925564n,\n",
       " bn:05066448n,\n",
       " bn:01860845n,\n",
       " bn:14978871n,\n",
       " bn:18247946n,\n",
       " bn:16747506n,\n",
       " bn:06946703n,\n",
       " bn:00015773n,\n",
       " bn:20033676n,\n",
       " bn:00077977n,\n",
       " bn:15300937n,\n",
       " bn:14714887n,\n",
       " bn:15658533n,\n",
       " bn:14770557n,\n",
       " bn:00775951n,\n",
       " bn:02906957n,\n",
       " bn:14957021n,\n",
       " bn:17073739n,\n",
       " bn:00036026n,\n",
       " bn:01872026n,\n",
       " bn:00037143n,\n",
       " bn:25762962n,\n",
       " bn:00042087n,\n",
       " bn:16074030n,\n",
       " bn:01913924n,\n",
       " bn:16502194n,\n",
       " bn:14945703n,\n",
       " bn:09261471n,\n",
       " bn:06947240n,\n",
       " bn:16284459n,\n",
       " bn:00492226n,\n",
       " bn:00054153n,\n",
       " bn:00028691n,\n",
       " bn:16181487n,\n",
       " bn:00045630n,\n",
       " bn:02253569n,\n",
       " bn:21813075n,\n",
       " bn:16063678n,\n",
       " bn:09264183n,\n",
       " bn:13841354n,\n",
       " bn:14770369n,\n",
       " bn:06834527n,\n",
       " bn:20033026n,\n",
       " bn:15085225n,\n",
       " bn:16295947n,\n",
       " bn:03541745n,\n",
       " bn:15085654n,\n",
       " bn:22375025n,\n",
       " bn:16414842n,\n",
       " bn:09263752n,\n",
       " bn:17753731n,\n",
       " bn:16399569n,\n",
       " bn:15352760n,\n",
       " bn:06806391n,\n",
       " bn:16177732n,\n",
       " bn:16273264n,\n",
       " bn:00884041n,\n",
       " bn:15009161n,\n",
       " bn:13864777n,\n",
       " bn:00012362n,\n",
       " bn:23927949n,\n",
       " bn:17310063n,\n",
       " bn:00009668n,\n",
       " bn:06957087n,\n",
       " bn:01665575n,\n",
       " bn:17693408n,\n",
       " bn:17732920n,\n",
       " bn:13858925n,\n",
       " bn:01006715n,\n",
       " bn:04021833n,\n",
       " bn:15090172n,\n",
       " bn:15944736n,\n",
       " bn:16084311n,\n",
       " bn:15081673n,\n",
       " bn:16283485n,\n",
       " bn:15849156n,\n",
       " bn:15657009n,\n",
       " bn:17735786n,\n",
       " bn:00056068n,\n",
       " bn:16063101n,\n",
       " bn:15011507n,\n",
       " bn:16178587n,\n",
       " bn:01353068n,\n",
       " bn:15191387n,\n",
       " bn:03414365n,\n",
       " bn:02274488n,\n",
       " bn:03109303n,\n",
       " bn:24323222n,\n",
       " bn:00073430n,\n",
       " bn:15200435n,\n",
       " bn:13864046n,\n",
       " bn:16183896n,\n",
       " bn:15495838n,\n",
       " bn:15201301n,\n",
       " bn:16077599n,\n",
       " bn:00015908n,\n",
       " bn:00058264n,\n",
       " bn:15657418n,\n",
       " bn:11281336n,\n",
       " bn:25221272n,\n",
       " bn:01942021n,\n",
       " bn:15479210n,\n",
       " bn:06946946n,\n",
       " bn:16121808n,\n",
       " bn:18098803n,\n",
       " bn:16117431n,\n",
       " bn:16204124n,\n",
       " bn:01885929n,\n",
       " bn:01353250n,\n",
       " bn:16401520n,\n",
       " bn:10485184n,\n",
       " bn:15009019n,\n",
       " bn:14967240n,\n",
       " bn:00047446n,\n",
       " bn:00069946n,\n",
       " bn:17741066n,\n",
       " bn:09264390n,\n",
       " bn:17759535n,\n",
       " bn:17429317n,\n",
       " bn:00023660n,\n",
       " bn:02247464n,\n",
       " bn:14771012n,\n",
       " bn:01860833n,\n",
       " bn:24715841n,\n",
       " bn:15199749n,\n",
       " bn:01353310n,\n",
       " bn:23614222n,\n",
       " bn:05071679n,\n",
       " bn:01353232n,\n",
       " bn:19789444n,\n",
       " bn:05841656n,\n",
       " bn:14927088n,\n",
       " bn:17702207n,\n",
       " bn:16186250n,\n",
       " bn:00047302n,\n",
       " bn:02462630n,\n",
       " bn:14766823n,\n",
       " bn:06947261n,\n",
       " bn:00070524n,\n",
       " bn:09266641n,\n",
       " bn:16280410n,\n",
       " bn:02802317n,\n",
       " bn:13863919n,\n",
       " bn:00040751n,\n",
       " bn:00624164n,\n",
       " bn:00762733n,\n",
       " bn:03663206n,\n",
       " bn:21759279n,\n",
       " bn:00073293n,\n",
       " bn:14397521n,\n",
       " bn:24236080n,\n",
       " bn:06947237n,\n",
       " bn:16183696n,\n",
       " bn:16979481n,\n",
       " bn:21106566n,\n",
       " bn:15009216n,\n",
       " bn:14720886n,\n",
       " bn:00011439n,\n",
       " bn:22603965n,\n",
       " bn:06841139n,\n",
       " bn:06947223n,\n",
       " bn:16199689n,\n",
       " bn:13864060n,\n",
       " bn:17756898n,\n",
       " bn:00059562n,\n",
       " bn:00067325n,\n",
       " bn:25370066n,\n",
       " bn:14041551n,\n",
       " bn:16073852n,\n",
       " bn:03054854n,\n",
       " bn:03739509n,\n",
       " bn:16059321n,\n",
       " bn:16441647n,\n",
       " bn:02381908n,\n",
       " bn:03329875n,\n",
       " bn:15090169n,\n",
       " bn:13864143n,\n",
       " bn:03034182n,\n",
       " bn:00080352n,\n",
       " bn:10270015n,\n",
       " bn:15086110n,\n",
       " bn:16200932n,\n",
       " bn:16112922n,\n",
       " bn:26685388n,\n",
       " bn:16754365n,\n",
       " bn:05539089n,\n",
       " bn:13864158n,\n",
       " bn:01531985n,\n",
       " bn:15352611n,\n",
       " bn:16280514n,\n",
       " bn:04764880n,\n",
       " bn:16281496n,\n",
       " bn:06909762n,\n",
       " bn:15195660n,\n",
       " bn:05067478n,\n",
       " bn:00023961n,\n",
       " bn:14768799n,\n",
       " bn:18166580n,\n",
       " bn:15200928n,\n",
       " bn:00036838n,\n",
       " bn:15085409n,\n",
       " bn:06500134n,\n",
       " bn:00069807n,\n",
       " bn:14973745n,\n",
       " bn:15192147n,\n",
       " bn:15549336n,\n",
       " bn:16394755n,\n",
       " bn:14767614n,\n",
       " bn:14474847n,\n",
       " bn:14771811n,\n",
       " bn:14964281n,\n",
       " bn:16181040n,\n",
       " bn:16280848n,\n",
       " bn:09263045n,\n",
       " bn:00077907n,\n",
       " bn:16283493n,\n",
       " bn:25805583n,\n",
       " bn:16221510n,\n",
       " bn:14474842n,\n",
       " bn:03054866n,\n",
       " bn:15351236n,\n",
       " bn:16893547n,\n",
       " bn:15362077n,\n",
       " bn:15657137n,\n",
       " bn:15353082n,\n",
       " bn:06514821n,\n",
       " bn:16183394n,\n",
       " bn:16975667n,\n",
       " bn:09265822n,\n",
       " bn:15585324n,\n",
       " bn:01862303n,\n",
       " bn:00026881n,\n",
       " bn:13860268n,\n",
       " bn:02368754n,\n",
       " bn:15085350n,\n",
       " bn:16399500n,\n",
       " bn:22586020n,\n",
       " bn:23951519n,\n",
       " bn:10742835n,\n",
       " bn:06946972n,\n",
       " bn:01465007n,\n",
       " bn:16845880n,\n",
       " bn:18098285n,\n",
       " bn:17229024n,\n",
       " bn:00010484n,\n",
       " bn:22586675n,\n",
       " bn:16334200n,\n",
       " bn:03126108n,\n",
       " bn:16273103n,\n",
       " bn:16502184n,\n",
       " bn:15357529n,\n",
       " bn:05059437n,\n",
       " bn:05784841n,\n",
       " bn:03312911n,\n",
       " bn:16088679n,\n",
       " bn:01696299n,\n",
       " bn:16498231n,\n",
       " bn:16537649n,\n",
       " bn:16572053n,\n",
       " bn:16272906n,\n",
       " bn:13860457n,\n",
       " bn:14975884n,\n",
       " bn:14771531n,\n",
       " bn:00434518n,\n",
       " bn:16502203n,\n",
       " bn:16583041n,\n",
       " bn:02573658n,\n",
       " bn:01954176n,\n",
       " bn:01611153n,\n",
       " bn:24161240n,\n",
       " bn:16114573n,\n",
       " bn:06814203n,\n",
       " bn:08602271n,\n",
       " bn:00075892n,\n",
       " bn:05074705n,\n",
       " bn:17734467n,\n",
       " bn:15195868n,\n",
       " bn:15652840n,\n",
       " bn:00024655n,\n",
       " bn:14924155n,\n",
       " bn:14973850n,\n",
       " bn:16280083n,\n",
       " bn:06891762n,\n",
       " bn:20033437n,\n",
       " bn:16121009n,\n",
       " bn:05071557n,\n",
       " bn:06947051n,\n",
       " bn:16403638n,\n",
       " bn:00933004n,\n",
       " bn:16219824n,\n",
       " bn:14971666n,\n",
       " bn:22585683n,\n",
       " bn:20033495n,\n",
       " bn:15495668n,\n",
       " bn:18077795n,\n",
       " bn:25708459n,\n",
       " bn:05066083n,\n",
       " bn:07196817n,\n",
       " bn:03156946n,\n",
       " bn:01313491n,\n",
       " bn:15781209n,\n",
       " bn:06840769n,\n",
       " bn:01299460n,\n",
       " bn:15484078n,\n",
       " bn:09261168n,\n",
       " bn:25940260n,\n",
       " bn:06870676n,\n",
       " bn:05526903n,\n",
       " bn:01862237n,\n",
       " bn:01878477n,\n",
       " bn:14973326n,\n",
       " bn:16391447n,\n",
       " bn:10143427n,\n",
       " bn:16064750n,\n",
       " bn:00061370n,\n",
       " bn:15008555n,\n",
       " bn:20033412n,\n",
       " bn:01885863n,\n",
       " bn:23805211n,\n",
       " bn:15191728n,\n",
       " bn:20033470n,\n",
       " bn:18098765n,\n",
       " bn:21600959n,\n",
       " bn:01625583n,\n",
       " bn:06947006n,\n",
       " bn:16199675n,\n",
       " bn:00030747n,\n",
       " bn:15656635n,\n",
       " bn:00035650n,\n",
       " bn:14957138n,\n",
       " bn:00041965n,\n",
       " bn:16394992n,\n",
       " bn:12394838n,\n",
       " bn:00234233n,\n",
       " bn:02919138n,\n",
       " bn:06891605n,\n",
       " bn:15365747n,\n",
       " bn:03644823n,\n",
       " bn:14976259n,\n",
       " bn:16182244n,\n",
       " bn:14817810n,\n",
       " bn:24563097n,\n",
       " bn:16173858n,\n",
       " bn:04873215n,\n",
       " bn:14974137n,\n",
       " bn:05130135n,\n",
       " bn:01910185n,\n",
       " bn:01431582n,\n",
       " bn:05207662n,\n",
       " bn:15628341n,\n",
       " bn:14957256n,\n",
       " bn:06840771n,\n",
       " bn:14955589n,\n",
       " bn:16402100n,\n",
       " bn:16072840n,\n",
       " bn:01860855n,\n",
       " bn:20032457n,\n",
       " bn:06506021n,\n",
       " bn:16200071n,\n",
       " bn:00035842n,\n",
       " bn:01862275n,\n",
       " bn:16601362n,\n",
       " bn:02349112n,\n",
       " bn:06487681n,\n",
       " bn:24105356n,\n",
       " bn:00062081n,\n",
       " bn:06853081n,\n",
       " bn:16605349n,\n",
       " bn:18404002n,\n",
       " bn:00054311n,\n",
       " bn:01871978n,\n",
       " bn:01313500n,\n",
       " bn:16405086n,\n",
       " bn:00053109n,\n",
       " bn:15352479n,\n",
       " bn:22586635n,\n",
       " bn:01353319n,\n",
       " bn:21769465n,\n",
       " bn:16600555n,\n",
       " bn:00077790n,\n",
       " bn:16183483n,\n",
       " bn:00579984n,\n",
       " bn:15500628n,\n",
       " bn:17545817n,\n",
       " bn:16154459n,\n",
       " bn:06514775n,\n",
       " bn:15076084n,\n",
       " bn:14269736n,\n",
       " bn:16186010n,\n",
       " bn:09263052n,\n",
       " bn:16217209n,\n",
       " bn:15351457n,\n",
       " bn:17381876n,\n",
       " bn:16077593n,\n",
       " bn:16300262n,\n",
       " bn:23546841n,\n",
       " bn:00055722n,\n",
       " bn:05192875n,\n",
       " bn:00066613n,\n",
       " bn:16120278n,\n",
       " bn:06947250n,\n",
       " bn:01862300n,\n",
       " bn:01862305n,\n",
       " bn:15532227n,\n",
       " bn:00032292n,\n",
       " bn:15192125n,\n",
       " bn:16074248n,\n",
       " bn:17671765n,\n",
       " bn:15196795n,\n",
       " bn:15009595n,\n",
       " bn:12176387n,\n",
       " bn:00022661n,\n",
       " bn:16507234n,\n",
       " bn:16399561n,\n",
       " bn:00041543n,\n",
       " bn:16722424n,\n",
       " bn:16181623n,\n",
       " bn:20033053n,\n",
       " bn:00022877n,\n",
       " bn:02326606n,\n",
       " bn:18098614n,\n",
       " bn:16083776n,\n",
       " bn:22903315n,\n",
       " bn:14765882n,\n",
       " bn:16502709n,\n",
       " bn:16405555n,\n",
       " bn:14984670n,\n",
       " bn:12635532n,\n",
       " bn:16177975n,\n",
       " bn:14959361n,\n",
       " bn:16405200n,\n",
       " bn:01465266n,\n",
       " bn:00035773n,\n",
       " bn:07524412n,\n",
       " bn:16502704n,\n",
       " bn:10742708n,\n",
       " bn:15365744n,\n",
       " bn:08881896n,\n",
       " bn:16219813n,\n",
       " bn:16204063n,\n",
       " bn:17635793n,\n",
       " bn:00068229n,\n",
       " bn:00015181n,\n",
       " bn:15819922n,\n",
       " bn:14959341n,\n",
       " bn:00026604n,\n",
       " bn:16283444n,\n",
       " bn:01514224n,\n",
       " bn:16601164n,\n",
       " bn:15479177n,\n",
       " bn:06606693n,\n",
       " bn:21370254n,\n",
       " bn:15365863n,\n",
       " bn:15351356n,\n",
       " bn:04946833n,\n",
       " bn:03087839n,\n",
       " bn:16284600n,\n",
       " bn:00139972n,\n",
       " bn:22283146n,\n",
       " bn:00023739n,\n",
       " bn:07524415n,\n",
       " bn:14976005n,\n",
       " bn:00970917n,\n",
       " bn:00021970n,\n",
       " bn:20033436n,\n",
       " bn:00424503n,\n",
       " bn:16399388n,\n",
       " bn:16084787n,\n",
       " bn:16273432n,\n",
       " bn:01912640n,\n",
       " bn:06845384n,\n",
       " bn:00081447n,\n",
       " bn:15652833n,\n",
       " bn:00026081n,\n",
       " bn:00414802n,\n",
       " bn:01071227n,\n",
       " bn:16320358n,\n",
       " bn:00030329n,\n",
       " bn:00005130n,\n",
       " bn:00079562n,\n",
       " bn:01151727n,\n",
       " bn:16220880n,\n",
       " bn:16280935n,\n",
       " bn:21251317n,\n",
       " bn:06490767n,\n",
       " bn:16219913n,\n",
       " bn:06969450n,\n",
       " bn:03411501n,\n",
       " bn:06946616n,\n",
       " bn:02283340n,\n",
       " bn:02587515n,\n",
       " bn:00045747n,\n",
       " bn:23614233n,\n",
       " bn:01005339n,\n",
       " bn:16281494n,\n",
       " bn:12774688n,\n",
       " bn:00056120n,\n",
       " bn:01811995n,\n",
       " bn:16601507n,\n",
       " bn:14946025n,\n",
       " bn:16201059n,\n",
       " bn:00074539n,\n",
       " bn:06565312n,\n",
       " bn:15192057n,\n",
       " bn:16391913n,\n",
       " bn:01907417n,\n",
       " bn:01985181n,\n",
       " bn:17123636n,\n",
       " bn:00072418n,\n",
       " bn:06946715n,\n",
       " bn:27269907n,\n",
       " bn:17484706n,\n",
       " bn:00001474n,\n",
       " bn:04103650n,\n",
       " bn:16582980n,\n",
       " bn:16754449n,\n",
       " bn:13859291n,\n",
       " bn:16405022n,\n",
       " bn:10853683n,\n",
       " bn:17757303n,\n",
       " bn:15191927n,\n",
       " bn:06946975n,\n",
       " bn:16199936n,\n",
       " bn:10815117n,\n",
       " bn:23295285n,\n",
       " bn:13858991n,\n",
       " bn:01554366n,\n",
       " bn:16747513n,\n",
       " bn:01862179n,\n",
       " bn:16585555n,\n",
       " bn:16977008n,\n",
       " bn:01707278n,\n",
       " bn:14084971n,\n",
       " bn:00025888n,\n",
       " bn:14959542n,\n",
       " bn:00049317n,\n",
       " bn:16221826n,\n",
       " bn:24197423n,\n",
       " bn:16295935n,\n",
       " bn:04172384n,\n",
       " bn:15351251n,\n",
       " bn:16747185n,\n",
       " bn:16074115n,\n",
       " bn:17529198n,\n",
       " bn:14976671n,\n",
       " bn:16081597n,\n",
       " bn:15495439n,\n",
       " bn:16498254n,\n",
       " bn:09264393n,\n",
       " bn:00595671n,\n",
       " bn:16754572n,\n",
       " bn:01525136n,\n",
       " bn:17762051n,\n",
       " bn:04533241n,\n",
       " bn:17632690n,\n",
       " bn:20033161n,\n",
       " bn:00028674n,\n",
       " bn:22814183n,\n",
       " bn:16220816n,\n",
       " bn:01466837n,\n",
       " bn:16121215n,\n",
       " bn:15196242n,\n",
       " bn:16606110n,\n",
       " bn:06934091n,\n",
       " bn:20033420n,\n",
       " bn:00969330n,\n",
       " bn:02751627n,\n",
       " bn:15364967n,\n",
       " bn:14474877n,\n",
       " bn:15192119n,\n",
       " bn:16929712n,\n",
       " bn:00351078n,\n",
       " bn:16893237n,\n",
       " bn:00004848n,\n",
       " bn:16405678n,\n",
       " bn:00049704n,\n",
       " bn:16123632n,\n",
       " bn:00029702n,\n",
       " bn:15653856n,\n",
       " bn:05007570n,\n",
       " bn:15082622n,\n",
       " bn:15195092n,\n",
       " bn:16386350n,\n",
       " bn:15653827n,\n",
       " bn:05079286n,\n",
       " bn:16846085n,\n",
       " bn:00067703n,\n",
       " bn:04792943n,\n",
       " bn:16221319n,\n",
       " bn:14970909n,\n",
       " bn:01886002n,\n",
       " bn:16300493n,\n",
       " bn:16792858n,\n",
       " bn:06862684n,\n",
       " bn:00074410n,\n",
       " bn:15008059n,\n",
       " bn:00024148n,\n",
       " bn:09264389n,\n",
       " bn:10691440n,\n",
       " bn:10742845n,\n",
       " bn:01353297n,\n",
       " bn:16979502n,\n",
       " bn:16747234n,\n",
       " bn:11267660n,\n",
       " bn:16284248n,\n",
       " bn:04065326n,\n",
       " bn:01889605n,\n",
       " bn:05453536n,\n",
       " bn:17690400n,\n",
       " bn:14084194n,\n",
       " bn:09266612n,\n",
       " bn:16183769n,\n",
       " bn:03556222n,\n",
       " bn:19023123n,\n",
       " bn:14946282n,\n",
       " bn:02341217n,\n",
       " bn:01862195n,\n",
       " bn:16415477n,\n",
       " bn:16113261n,\n",
       " bn:17754321n,\n",
       " bn:16032767n,\n",
       " bn:16402085n,\n",
       " bn:16347810n,\n",
       " bn:16405123n,\n",
       " bn:02758963n,\n",
       " bn:16177738n,\n",
       " bn:01353286n,\n",
       " bn:00080413n,\n",
       " bn:00010001n,\n",
       " bn:14766834n,\n",
       " bn:01861464n,\n",
       " bn:15196221n,\n",
       " bn:16174026n,\n",
       " bn:16722416n,\n",
       " bn:00015427n,\n",
       " bn:00668694n,\n",
       " bn:24357481n,\n",
       " bn:25614429n,\n",
       " bn:15351456n,\n",
       " bn:17381137n,\n",
       " bn:27259144n,\n",
       " bn:16405689n,\n",
       " bn:23651466n,\n",
       " bn:16405235n,\n",
       " bn:08875297n,\n",
       " bn:08371910n,\n",
       " ...}"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "visited"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'p': [{'synsetID': 'bn:00067319n'},\n",
       "   'IS_A',\n",
       "   {'synsetID': 'bn:00053867n'},\n",
       "   'IS_A',\n",
       "   {'synsetID': 'bn:00062164n'},\n",
       "   'IS_A',\n",
       "   {'synsetID': 'bn:00058442n'},\n",
       "   'IS_A',\n",
       "   {'synsetID': 'bn:00035942n'},\n",
       "   'IS_A',\n",
       "   {'synsetID': 'bn:14770561n'}]}]"
      ]
     },
     "execution_count": 81,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# TESTING SHORTEST PATH\n",
    "import pandas as pd\n",
    "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "    #records, summary, keys \n",
    "    result = driver.execute_query(\n",
    "        shortestPath_query, \n",
    "        {'synsetID_1': 'bn:00067319n',\n",
    "         'synsetID_2': 'bn:14770561n'},\n",
    "        database_='neo4j',\n",
    "        result_transformer_=neo4j.Result.data)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "metadata": {},
   "outputs": [],
   "source": [
    "result = result[0]['p']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "residue\n",
      "matter\n",
      "physical_entity\n",
      "object\n",
      "geological_formation\n",
      "Williamsville_Formation\n"
     ]
    }
   ],
   "source": [
    "for item in result:\n",
    "    if type(item) is dict and 'synsetID' in item.keys():\n",
    "        print(BabelSynsetID(item['synsetID']).to_synset().main_sense(language=Language.EN).full_lemma)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "ResolvedIPv4Address(('127.0.0.1', 7687))"
      ]
     },
     "execution_count": 61,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "bn.BabelSynset.main_sense"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "graphproject",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
